# 5. Python操作数据库
 - Python数据结构可视化工具: http://www.pythontutor.com (查看内存数据)
 - MySQL数据库的基本操作
 - 用Python操作数据库
 - 编写Python爬虫并保存到数据库

## 5.1数据库
 - 关系型数据库
     - MySQL数据库：开源、免费 (现已被Oracle收购)
     - MariaDB：与MySQL完全兼容且免费 
 - 非关系型数据库
     - MongoDB
     - Redis

 - JSON格式

In [20]:
# import json
# with open('D:\APractise\data\data.json') as f:
# #     data = json.loads(f)
#     print(list(f.readlines))

import json  

data = {}
with open('D:\APractise\data\data.json',encoding='utf-8') as f: #打开‘data.json’的json文件
    res = f.read() #读文件
    data = json.loads(res) #把json串变成python的数据类型：字典  
    print(data)

print(data['iphone'])    

data_1 = "{'a':100, 'b':100}"  # format is bad
data_2 = '{"a":100,"b":200}'   # format is good

j_data = json.loads(data_2)  # json.loads参数为字符串
print(j_data)

with open('D:\APractise\data\data.json','r') as f: #打开‘data.json’的json文件
    data = json.load(f)  # json.load参数为文件句柄
    print('data={}'.format(data))

{'iphone': {'color': 'red', 'num': 1, 'price': 98.5}, 'wather': {'num': 100, 'price': 1, 'color': 'white'}}
{'color': 'red', 'num': 1, 'price': 98.5}
{'a': 100, 'b': 200}
data={'iphone': {'color': 'red', 'num': 1, 'price': 98.5}, 'wather': {'num': 100, 'price': 1, 'color': 'white'}}

## 5.2 使用命令行操作数据
 - 以下命令都是在数据库终端执行

In [4]:
## 连接数据库
mysql -u root -p   
# u是用户名，p 需要用户密码登录数据库

## 查看数据库
show databases; 

## 选择数据库
use database_name;

## 查看数据库中的table
show tables;

## 查看表的结构
desc table_name;

##  查看表中的内容
select * from table_name;

##  只看前10条记录
select * from table_name limit 10;

### 5.2.1 数据库管理工具
 - Sequel Pro：数据库管理工具(http://www.sequelpro.com) (MacOS)
 - NvaiCat：数据库管理工具 （Windows)
     - https://www.cr173.com/soft/126934.html
     - https://blog.csdn.net/damaibao/article/details/91360061

### 5.2.2 MySQL与Excel的不同
 - Excel不存储太多的数据
 - Excel每次打开所有的数据, 不能只打开想要的数据
 - Excel无法把重复数据独立成一张表，信息冗余量大

### 5.2.3 命令行操作数据库
 - 数据类型：http://www.runoob.com/mysql/mysql-data-types.html
 - 整数数据类型
  - TINYINT：1 
  - SMALLINT：2 
  - MEDIUMINT：3 
  - INT：4 
  - BIGINT：8 
  - FLOAT：4 
  - DOUBLE：8 
  - DECIMAL：DECIMAL(M,D) 

 - 日期和时间类型
  - DATE
  - TIME
  - YEAR
  - DATETIME
  - TIMESTAMP
 - 字符串类型
  - CHAR (0-255)
  - VARCHAR (变长)
  - TINYBLOB
  - TINYTEXT
  - BLOB
  - TEXT
  - MEDIUMBLOB
  - MEDIUMTEXT
  - LONGBLOB
  - LONGTEXT

In [ ]:
## 创建数据库
create database mydb; 

## 删除数据库
drop database mydb;

## 指定字符集和校对集,创建数据库
create database mydb default charset utf8mb4 collate utf8mb4_general_ci;

## 创建表格
# id INT(11), 不足11位时，当选择了zerofill,前面不足11位的用0填充,

CREATE TABLE tb_class 
(
id INT(11) NOT NULL AUTO_INCREMENT, 
name VARCHAR(80) NOT NULL, 
PRIMARY KEY(id)
);

    
CREATE TABLE tb_score
(
id INT(11)  NOT NULL AUTO_INCREMENT,
student_id INT(11) NOT NULL,
subject_id INT(11) NOT NULL,
exam_id INT(11) NOT NULL,
score INT(11) NOT NULL,
PRIMARY KEY(id)
);


CREATE TABLE tb_student
(
id INT(11) unsigned NOT NULL AUTO_INCREMENT,
class_id INT(11) NOT NULL,
sex CHAR(10) CHARACTER SET utf8 NOT NULL,
name VARCHAR(80) CHARACTER SET utf8 NOT NULL,
PRIMARY KEY(id)
);


CREATE TABLE tb_subject
(
id INT(11) unsigned NOT NULL AUTO_INCREMENT,
name VARCHAR(80) CHARACTER SET utf8,
PRIMARY KEY(id)   
);
 

## 插入数据
# INSERT INTO table_name ( field1, field2,...fieldN )
#                        VALUES
#                        ( value1, value2,...valueN );

INSERT INTO tb_class (name) VALUES ('初一1班');
INSERT INTO tb_class (name) VALUES ('初一2班');
INSERT INTO tb_class (name) VALUES ('初一3班');
INSERT INTO tb_class (name) VALUES ('初一4班');
INSERT INTO tb_class (name) VALUES ('初一5班');
INSERT INTO tb_class (name) VALUES ('初一6班');


## 查询数据
# SELECT column_name,column_name
# FROM table_name
# [WHERE Clause]
# [LIMIT N][ OFFSET M]
SELECT * FROM tb_class;

## 修改数据
# UPDATE table_name SET field1=new-value1, field2=new-value2
# [WHERE Clause]
UPDATE tb_class SET name='初一一班' where id=1;


## 删除数据
# DELETE FROM table_name [WHERE Clause]
DELETE FROM tb_class where id=1;

## 5.3 使用Python操作数据库
 - 在Python3的Anaconda3环境下，执行pip install mysqlclient-1.4.6-cp36-cp36m-win_amd64.whl安装MySQLdb

In [2]:
import MySQLdb
DATABASE={
    'host':'127.0.0.1', 
    'database':'study',
    'user':'root',
    'password':'123456',
    'charset':'utf8'
}

# db = MySQLdb.connect(host='127.0.0.1', user='root', password='123456', db='study')
db = MySQLdb.connect(**DATABASE)
# db代表study数据库

- 游标

In [46]:
cursor = db.cursor()

## 查询函数
def query_execute(sql):
    cursor.execute(sql)
    results = cursor.fetchall()
    for row in results:
        print(row)
        
def query_all(tbl_name):
    sql = "SELECT * FROM " + tbl_name
    query_execute(sql)

def query_condition(tbl_name, name):
    sql = "SELECT * FROM {} WHERE name='{}'".format(tbl_name, name)
    query_execute(sql)
    
def operate_execute(sql):
    cursor.execute(sql)
    db.commit()
    
    
print("===========Query All========")        
query_all('tb_class')

print("===========Query 初一9班========")        
query_condition('tb_class', '初一9班')




        
## 插入操作
sql = "INSERT INTO tb_class (name) VALUES ('初一9班')"
cursor.execute(sql)
sql = "INSERT INTO tb_class (name) VALUES ('初一10班')"
cursor.execute(sql)
db.commit()

# print("===========Before Insert========")
# query_tb_class(tb_name) 
 
## 删除操作
sql = "DELETE FROM tb_class WHERE name='初一10班'"
cursor.execute(sql)
db.commit()


print("===========Query 初一9班========")        
query_condition('tb_class', '初一9班')

## 更新操作
sql = "UPDATE tb_class set name='初一20班' WHERE name='初一9班'"
cursor.execute(sql)
db.commit()

print("===========Query 初一9班========") 
query_condition('tb_class', '初一9班')

===========Query All========
(1, '初一一班')
(3, '初一3班')
(4, '初一4班')
(5, '初一5班')
(6, '初一7班')
(7, '初一2班')
(8, '初一8班')
(47, '初一20班')
(49, '初一20班')
(51, '初一20班')
(53, '初一20班')
(55, '初一20班')
(57, '初一20班')
(59, '初一20班')
(61, '初一20班')
(63, '初一20班')
===========Query 初一9班========
===========Query 初一9班========
(65, '初一9班')
===========Query 初一9班========

 - 捕捉异常

In [53]:
try:
    a = 10
    b = a + "hello"
except TypeError as e:    
# except Exception as e:
    print(e)

unsupported operand type(s) for +: 'int' and 'str'

In [62]:
try:
    sql = "INSERT INTO tb_class (name) VALUES ('初一100班')"
    cursor.execute(sql)
    db.commit()
    a = 10
    b = 10 + "HELLO"
except Exception as e:
    db.rollback()  # 回滚
    print('ERROR:',e)

query_condition('tb_class', '初一100班')

ERROR: unsupported operand type(s) for +: 'int' and 'str'
(67, '初一100班')
(68, '初一100班')
(69, '初一100班')
(70, '初一100班')
(71, '初一100班')
(72, '初一100班')
(73, '初一100班')
(74, '初一100班')